# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [50]:
import pandas as pd

url = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv"
df = pd.read_csv(url)
df.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [51]:
def clean_col(name: str) -> str:
    s = name.strip().lower()
    s = s.replace("\t", " ").replace("-", " ")
    
    while "  " in s:
        s = s.replace("  ", " ")

    parts = [("state" if p == "st" else p) for p in s.split(" ") if p != ""]
    s = "_".join(parts)

    s = s.strip("_")
    return s

In [52]:
df.columns = [clean_col(c) for c in df.columns]

In [53]:
df.columns.tolist()

['customer',
 'state',
 'gender',
 'education',
 'customer_lifetime_value',
 'income',
 'monthly_premium_auto',
 'number_of_open_complaints',
 'policy_type',
 'vehicle_class',
 'total_claim_amount']

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they only contain valid data.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [ ]:
s = df['gender'].astype(str).str.strip().str.lower()

df['gender'] = s.map({'f': 'F', 'female': 'F', 'femal': 'F','m': 'M', 'male': 'M'}).fillna(df['gender'])

In [ ]:
s = df['state'].astype(str).str.strip().str.lower()

state_map = {'az': 'arizona','wa': 'washington','cali': 'california'}

df['state'] = s.replace(state_map).str.title()

In [ ]:
df['education'] = (df['education'].astype(str).str.strip().str.title().replace({'Bachelors': 'Bachelor'}))

In [ ]:
df['customer_lifetime_value'] = (df['customer_lifetime_value'].astype(str).str.replace('%', '', regex=False).astype(float))

In [ ]:
df['vehicle_class'] = (df['vehicle_class'].astype(str).str.strip().str.title().replace({'Sports Car': 'Luxury','Luxury Suv': 'Luxury','Luxury Car': 'Luxury'}))
df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18,0.0,106.0,1/0/00,Corporate Auto,Suv,529.881344
4,GA49547,Washington,M,High School Or Below,536307.65,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has an incorrect format. Look at the different values it takes with `unique()` and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [ ]:
df.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value      float64
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [ ]:
df['customer_lifetime_value'] = pd.to_numeric(df['customer_lifetime_value'], errors='coerce')
df['customer_lifetime_value'].head(10)

0           NaN
1     697953.59
2    1288743.17
3     764586.18
4     536307.65
5     825629.78
6     538089.86
7     721610.03
8    2412750.40
9     738817.81
Name: customer_lifetime_value, dtype: float64

In [ ]:
df[['customer_lifetime_value']].dtypes

customer_lifetime_value    float64
dtype: object

In [ ]:
mid = (df['number_of_open_complaints']
       .astype(str)
       .str.replace('-', '/', regex=False)
       .str.split('/')                      
       .str.get(1)) 

df['number_of_open_complaints'] = pd.to_numeric(mid, errors='coerce').astype('Int64')
df['number_of_open_complaints'].head(10)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
7    0
8    0
9    0
Name: number_of_open_complaints, dtype: Int64

In [ ]:
df[['number_of_open_complaints']].dtypes

number_of_open_complaints    Int64
dtype: object

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the `isnull()` function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)

Implement your chosen strategy to handle the null values. You can use the `fillna()` function in pandas to fill null values or `dropna()` function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the `isnull()` function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers.

In [ ]:
df.isnull().sum()

customer                     2937
state                           0
gender                       3054
education                       0
customer_lifetime_value      2940
income                       2937
monthly_premium_auto         2937
number_of_open_complaints    2937
policy_type                  2937
vehicle_class                   0
total_claim_amount           2937
dtype: int64

In [ ]:
(df.isnull().sum() / len(df)) * 100

customer                     73.278443
state                         0.000000
gender                       76.197605
education                     0.000000
customer_lifetime_value      73.353293
income                       73.278443
monthly_premium_auto         73.278443
number_of_open_complaints    73.278443
policy_type                  73.278443
vehicle_class                 0.000000
total_claim_amount           73.278443
dtype: float64

In [46]:
for col in df.columns:
    if df[col].dtype in ['float64', 'int64', 'Int64']:     # numéricos
        df[col] = df[col].fillna(df[col].median())
    else:                                                  # categóricos
        df[col] = df[col].fillna(df[col].mode()[0])

df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,F,Master,588174.235,0.0,1000.0,0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.590,0.0,94.0,0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.170,48767.0,108.0,0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.180,0.0,106.0,0,Corporate Auto,Suv,529.881344
4,GA49547,Washington,M,High School Or Below,536307.650,36357.0,68.0,0,Personal Auto,Four-Door Car,17.269323

In [57]:
df.isnull().sum()

customer                     2937
state                        2937
gender                       3054
education                    2937
customer_lifetime_value      2940
income                       2937
monthly_premium_auto         2937
number_of_open_complaints    2937
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [62]:
num_cols = df.select_dtypes(include=['float64','int64','Int64']).columns
df[num_cols] = df[num_cols].replace([float('inf'), -float('inf')], pd.NA)

df[num_cols].isna().sum().sort_values(ascending=False)

income                  2937
monthly_premium_auto    2937
total_claim_amount      2937
dtype: int64

## Exercise 5: Dealing with duplicates

Use the `.duplicated()` method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the `drop_duplicates()` function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using `.duplicated()`.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [65]:
df.duplicated().sum()                         
df[df.duplicated(keep=False)].head(10)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
1071,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1072,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1073,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1074,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1075,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1076,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1077,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1078,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1079,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1080,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [67]:
subset_cols = [c for c in ['customer','customer_id','policy_number','effective_to_date','email']
               if c in df.columns]
subset_cols

['customer']

In [68]:
df.duplicated(subset=subset_cols).sum() 
df[df.duplicated(subset=subset_cols, keep=False)][subset_cols].head(10)

     customer
1071      NaN
1072      NaN
1073      NaN
1074      NaN
1075      NaN
1076      NaN
1077      NaN
1078      NaN
1079      NaN
1080      NaN

In [69]:
df1 = df.drop_duplicates(keep='first').reset_index(drop=True)
df.shape, df1.shape 

if len(subset_cols) > 0:
    if 'effective_to_date' in df1.columns:
        df1 = df1.sort_values('effective_to_date', ascending=False)
    df2 = df1.drop_duplicates(subset=subset_cols, keep='first').reset_index(drop=True)
else:
    df2 = df1.copy()

df1.shape, df2.shape

((1072, 11), (1072, 11))

In [70]:
df2.duplicated().sum()
df2.duplicated(subset=subset_cols).sum() if len(subset_cols)>0 else 0

np.int64(0)

In [71]:
output_path = "cleaned_file1_no_duplicates.csv"
df2.to_csv(output_path, index=False)
output_path

'cleaned_file1_no_duplicates.csv'

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting.

Write these functions in separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [72]:
def clean_colnames(df: pd.DataFrame) -> pd.DataFrame:
    def _clean(name: str) -> str:
        s = str(name).strip().lower()
        s = s.replace("\t", " ").replace("-", " ")
        while "  " in s:
            s = s.replace("  ", " ")
        parts = [("state" if p == "st" else p) for p in s.split(" ") if p != ""]
        return "_".join(parts).strip("_")
    df = df.copy()
    df.columns = [_clean(c) for c in df.columns]
    return df

In [76]:
def clean_invalid_values(df: pd.DataFrame) -> pd.DataFrame:
    df = df.copy()

    if 'gender' in df.columns:
        g = df['gender'].astype(str).str.strip().str.lower().str[0]
        df['gender'] = g.where(g.isin(['m','f'])).map({'m':'M','f':'F'})

    if 'state' in df.columns:
        s = df['state'].astype(str).str.strip().str.lower()
        state_map = {
            'az':'arizona','arizona':'arizona',
            'cali':'california','ca':'california',
            'wa':'washington','ny':'new york'
        }
        df['state'] = s.replace(state_map).str.title()
    
    if 'education' in df.columns:
        df['education'] = (df['education'].astype(str).str.strip()
                           .str.replace('bachelors','bachelor',case=False)
                           .str.title())
        
    if 'customer_lifetime_value' in df.columns:
        df['customer_lifetime_value'] = (df['customer_lifetime_value']
                                         .astype(str)
                                         .str.replace('%','',regex=False)
                                         .str.replace(',','',regex=False))
    
    if 'vehicle_class' in df.columns:
        v = (df['vehicle_class'].astype(str).str.strip().str.lower()
             .replace({'sports car':'luxury','luxury suv':'luxury','luxury car':'luxury'}))
        df['vehicle_class'] = v.str.title()

    return df

In [77]:
def format_dtypes(df: pd.DataFrame) -> pd.DataFrame:
    df = df.copy()

    
    if 'customer_lifetime_value' in df.columns:
        df['customer_lifetime_value'] = pd.to_numeric(df['customer_lifetime_value'], errors='coerce')

   
    if 'number_of_open_complaints' in df.columns:
        mid = (df['number_of_open_complaints'].astype(str)
               .str.replace('-', '/', regex=False)
               .str.split('/').str.get(1))
        df['number_of_open_complaints'] = pd.to_numeric(mid, errors='coerce').astype('Int64')

    
    for col in ['number_of_policies','monthly_premium_auto','income','total_claim_amount']:
        if col in df.columns:
            df[col] = pd.to_numeric(df[col], errors='coerce')

    
    if 'effective_to_date' in df.columns:
        df['effective_to_date'] = pd.to_datetime(df['effective_to_date'], errors='coerce')

    
    for c in ['response','coverage','education','employmentstatus','gender',
              'location_code','state','vehicle_class']:
        if c in df.columns:
            df[c] = df[c].astype('category')

    return df

In [78]:
def handle_nulls(df: pd.DataFrame, numeric='median', categorical='mode') -> pd.DataFrame:

    df = df.copy()
    for col in df.columns:
        if str(df[col].dtype) in ['float64','int64','Int64']:
            if numeric == 'median':
                fill = df[col].median()
            elif numeric == 'mean':
                fill = df[col].mean()
            else:
                fill = numeric
            df[col] = df[col].fillna(fill)
        else:
            if categorical == 'mode':
                fill = df[col].mode(dropna=True)
                fill = fill.iloc[0] if not fill.empty else df[col].dropna().iloc[0] if df[col].notna().any() else ''
            else:
                fill = categorical
            df[col] = df[col].fillna(fill)
    return df

In [79]:
def drop_dupes(df: pd.DataFrame, subset_cols=None, keep='first') -> pd.DataFrame:
    df = df.copy()
    df = df.drop_duplicates(keep=keep).reset_index(drop=True)
    if subset_cols:
        used = [c for c in subset_cols if c in df.columns]
        if used:
            if 'effective_to_date' in df.columns:
                df = df.sort_values('effective_to_date', ascending=False)
            df = df.drop_duplicates(subset=used, keep=keep).reset_index(drop=True)
    return df

In [80]:
def clean_all(url: str | None = None, df: pd.DataFrame | None = None,
              subset_for_dupes=None, fill_numeric='median', fill_categorical='mode',
              return_copy=True) -> pd.DataFrame:

    assert (url is not None) ^ (df is not None), "Proporciona 'url' o 'df', pero no ambos."
    if url is not None:
        df = pd.read_csv(url)

    if return_copy:
        df = df.copy()

    df = clean_colnames(df)
    df = clean_invalid_values(df)
    df = format_dtypes(df)
    df = handle_nulls(df, numeric=fill_numeric, categorical=fill_categorical)
    df = drop_dupes(df, subset_cols=subset_for_dupes, keep='first')
    return df

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In the Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we had tried to work with that column, we wouldn't have been able to because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, let's get some more interesting insights!

Instructions:

- Review the statistics again for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the `.describe()` method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [82]:
df[['total_claim_amount', 'customer_lifetime_value']].describe()

       total_claim_amount
count         1071.000000
mean           404.986909
std            293.027260
min              0.382107
25%            202.157702
50%            354.729129
75%            532.800000
max           2893.239678

In [85]:
df['customer_lifetime_value'] = (df['customer_lifetime_value']
                                 .astype(str)
                                 .str.replace('%','',regex=False)
                                 .str.replace(',','',regex=False))
df['customer_lifetime_value'] = pd.to_numeric(df['customer_lifetime_value'], errors='coerce')
df['customer_lifetime_value'].head(10)

0           NaN
1     697953.59
2    1288743.17
3     764586.18
4     536307.65
5     825629.78
6     538089.86
7     721610.03
8    2412750.40
9     738817.81
Name: customer_lifetime_value, dtype: float64

In [86]:
p75_claim = df['total_claim_amount'].quantile(0.75)
p25_clv   = df['customer_lifetime_value'].quantile(0.25)
p75_claim, p25_clv

(np.float64(532.8), np.float64(403407.995))

In [87]:
high_claim_low_clv = df[
    (df['total_claim_amount'] >= p75_claim) &
    (df['customer_lifetime_value'] <= p25_clv)
]
high_claim_low_clv.shape

(41, 11)

In [88]:
high_claim_low_clv.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
17,OE15005,Cali,NaN,College,394524.16,28855.0,101.0,1/0/00,Personal Auto,SUV,647.442031
23,TZ98966,Nevada,NaN,Bachelor,245019.10,0.0,73.0,1/3/00,Corporate Auto,Four-Door Car,554.376763
26,US89481,California,NaN,Bachelor,394637.21,0.0,111.0,1/0/00,Personal Auto,Four-Door Car,799.200000
38,CM61827,Oregon,NaN,Bachelor,309003.41,0.0,90.0,1/0/00,Personal Auto,Two-Door Car,648.000000
42,IL19217,California,NaN,Bachelor,393900.64,60021.0,99.0,1/0/00,Personal Auto,Four-Door Car,882.871945

In [89]:
high_claim_low_clv[['total_claim_amount','customer_lifetime_value']].describe()

       total_claim_amount  customer_lifetime_value
count           41.000000                41.000000
mean           719.118612            340056.269512
std            150.389974             57043.699118
min            532.800000            228759.690000
25%            632.715382            289873.270000
50%            679.368378            365253.240000
75%            799.200000            387364.700000
max           1185.988301            402381.440000